**** 打印十六进制
     #+begin_src C -n -r :results raw
       #include <stdio.h>
       #include <ctype.h>
       void print_hex(const char *msg, unsigned char *bytes, int len) {
         char c;
         printf("%s: \n", msg);
         for (int i = 0; i < len; i += 16) {
           for (int j = 0; j < 16; j++)
             printf("%02X ", *(bytes+i+j));
           printf("\t");
           for (int j = 0; j < 16; j++) {
             c = *(bytes+i+j);
             printf("%c", isprint(c)?c:'.');
           }
           printf("\n");
         }
       }

       char bytes[32] = "1234abcd\x00\x01\x02\x03";
       print_hex("Hexdump-of-bytes", bytes, sizeof(bytes));
     #+end_src

     #+RESULTS:
     Hexdump-of-bytes: 
     31 32 33 34 61 62 63 64 00 01 02 03 00 00 00 00 	1234abcd........
     00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 00 	................
**** 利用 backtrace 捕捉断错误
      #+begin_src C -n -r :flags -g -rdynamic
        /*  complie with `gcc -g -rdynamic` */
        #include <stdio.h>
        #include <stdlib.h>
        #include <stddef.h>
        #include <execinfo.h>
        #include <signal.h>

        void sigsegv_handler(int signo) {
          void   *buffer[30] = {0};
          size_t size;
          char   **strings = NULL;
          size_t i = 0;

          size = backtrace(buffer, 30);
          fprintf(stdout, "Obtained-%zd-stack-frames.nm\n", size);
          strings = backtrace_symbols(buffer, size);
          if (strings == NULL) {
            perror("backtrace_symbols");
            exit(EXIT_FAILURE);
          }

          for (i = 0; i < size; i++)
            fprintf(stdout, "%s\n", strings[i]);

          free(strings);
          strings = NULL;
          exit(0);
        }

        void func_b() { *((volatile char *)0x0) = 0x9999; }
        void func_a() { func_b(); }

        int main() {
          if ( signal(SIGSEGV, sigsegv_handler) == SIG_ERR)
            perror("Can't catch SIGSEGV");
          func_a();
        }
      #+end_src

      #+RESULTS:
      | Obtained-7-stack-frames.nm                              |                  |
      | /tmp/babel-dq9xvl/C-bin-v3qcnA(sigsegv_handler+0x65)    | [0x556b3771026e] |
      | /lib/x86_64-linux-gnu/libc.so.6(+0x46210)               | [0x7f02de8f9210] |
      | /tmp/babel-dq9xvl/C-bin-v3qcnA(func_b+0xd)              | [0x556b37710367] |
      | /tmp/babel-dq9xvl/C-bin-v3qcnA(func_a+0x12)             | [0x556b3771037f] |
      | /tmp/babel-dq9xvl/C-bin-v3qcnA(main+0x35)               | [0x556b377103b7] |
      | /lib/x86_64-linux-gnu/libc.so.6(__libc_start_main+0xf3) | [0x7f02de8da0b3] |
      | /tmp/babel-dq9xvl/C-bin-v3qcnA(_start+0x2e)             | [0x556b3771014e] |

      参考: https://www.cnblogs.com/lidabo/p/5344768.html

**** finstrument-functions
     在进入与退出函数前调用。如果在一些平台不能通过 =__builtin_return_address=
     取得 caller 与 callee 相关的动态地址，则可以通过 =-finstrument-functions=。
     从 =__cyg= 开头的函数可以知道是 Cygnus 的贡献。
     #+begin_src C :results raw :flags -finstrument-functions
       #include <stdio.h>
       #define DUMP(func, call) printf("%s: func = %p, called by = %p\n", __FUNCTION__, func, call)

       void __attribute__((__no_instrument_function__))
       __cyg_profile_func_enter(void *this_func, void *call_site) {
         DUMP(this_func, call_site);
       }
       void __attribute__((__no_instrument_function__))
       __cyg_profile_func_exit(void *this_func, void *call_site) {
         DUMP(this_func, call_site);
       }

       int main() {
         puts("Hello World!");
         return 0;
       }
     #+end_src

     #+RESULTS:
     __cyg_profile_func_enter: func = 0x5637dbd361e3, called by = 0x7fba598da0b3
     Hello World!
     __cyg_profile_func_exit: func = 0x5637dbd361e3, called by = 0x7fba598da0b3
     
     应用：
       - 提供特制的 profiler: [[http://www.logix.cz/michal/devel/CygProfiler/][CypProfiler]]
       - 取得执行时期的 call graph: [[https://www.ibm.com/developerworks/cn/linux/l-graphvis/][用 Graphviz 可视化函数调用]]
       - 置入自制的 signal handler，实现 backtrace 功能: [[http://www.directfb.org/][DirectFB]]
       - 模拟 reflection 机制
       - [[http://www.celinuxforum.org/CelfPubWiki/KernelFunctionTrace][Kernel Function Trace]]
